app/controllers/admins_controller.rb

	def index
		@users = User.all
		@cats = Cat.all
---
SELECT "users".* FROM "users"
SELECT "cats".* FROM "cats"