app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE (content LIKE '%sdf%')  ORDER BY created_at DESC
---
  def index
    @cat = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @cat = Cat.find(params[:id])
    #puts @cat.inspect
    @cur_user = User.find(params[:id])

INSERT INTO "cats" ("name", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "pirojok"], ["text", "syka"], ["user_id", 1], ["created_at", "2016-05-28 20:49:54.774984"], ["updated_at", "2016-05-28 20:49:54.774984"]]
---
  def create
    @cat = Cat.new(cat_params)
    @cat.save