app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    #@user = User.find_by_name(params[:id])
    @user = User.find(params[:id])