app/controllers/welcome_controller.rb

  def index
    @cat = Cat.all
    @user = User.joins(:cats)
---
SELECT "cats".* FROM "cats"
SELECT "cats".* FROM "cats" INNER JOIN "users" ON "users"."id" = "cats"."user_id" WHERE "cats"."user_id" IS NULL
SELECT "users".* FROM "users" INNER JOIN "cats" ON "cats"."user_id" = "users"."id"